lines = {
    # H: harutrak - @fubukiefsf
    "HA": "harutrak A線",
    "HB": "harutrak B線",
    "HC": "harutrak C線",
    "HD": "harutrak D線",
    "HE": "harutrak E線",
    "HF": "harutrak F線",
    "HG": "harutrak G線",
    "HH": "harutrak H線",
    "HI": "harutrak I線",
    "HZ": "harutrak 空港連絡線",
    # R: はるレール - @ayafmy
    "RN": "はるレール 南北快速線",
    "RJ": "はるレール 城南線",
    "RT": "はるレール 新津線",
    "RS": "はるレール 城津線(西城線)",
    # E: はる急行鉄道 - @karno
    "ET": "はる急行鉄道 月沢本線",
    "EX": "はる急行鉄道 月沢急行線",
    "EN": "はる急行鉄道 南海急行線",
    "EK": "はる急行鉄道 北見線",
    "ES": "はる急行鉄道 参宮線",
    # S: はる高速旅客鉄道(新幹線) - @karno
    "SC": "はる高速旅客鉄道 中央新幹線",
    "SN": "はる高速旅客鉄道 南北新幹線",
    # M: ムメイ高速鉄道 - @mumei_himazin
    "MM": "ムメイ高速鉄道 ムメイ高速鉄道本線",
    "MK": "ムメイ高速鉄道 香住線",
    # N: はる近郊鉄道 - ?
    "NI": "はる近郊鉄道 内環線",
    "NA": "はる近郊鉄道 空港線",
    # K: こむぎ娘レールウェイ - @flour4445
    "KC": "こむぎ娘レールウェイ 千歳線",
    "KK": "こむぎ娘レールウェイ 海岸線",
    "KS": "こむぎ娘レールウェイ 作長線",
    "KT": "こむぎ娘レールウェイ 東海線",
    # L: 東部環状鉄道 - @ayafmy ?
    "LT": "東部環状鉄道 東部環状線",
    # T: 筑波臨海高速鉄道 - @karno
    "TR": "筑波臨海高速鉄道 りんかい線",
    # G: 竜ヶ崎臨海鉄道 - ?
    "GR": "竜ヶ崎臨海鉄道 竜ヶ崎線",
    # C: ささみ鉄道 - @sasamijp
    "CC": "ささみ鉄道 ちくわエクスプレス線",
    # A: はる航空 - @fubukiefsf ?
    "AO": "はる航空 はる空港-大室線",
    "AS": "はる航空 はる空港-しきみ島線",
    "AT": "はる航空 はる空港-津港ヘリポート線",
    # Z: その他(短距離区間・個人路線など)
    "ZC": "ふりかけ鉄道 Capital Line",
    "ZG": "SRH 外環線",
    "ZH": "かき地下鉄 姫子線",
    "ZK": "キルミー鉄道 ゆっくりライン",
    "ZS": "鮭の子村交通局 寿司線",
    "ZT": "はる地下鉄 調布市地下鉄線",
    "ZZ": "その他"
}
