#!/usr/bin/env python
# -*- coding: utf-8 -*-

# "路線コード": {
#     "駅コード": (X, Y, Z, "駅名"), ...
# }, ...
# ※駅名は可読性向上のために記述するものであり,
#  united_info.jsonの生成時等ではharu_stations.pyの名称を優先する。
#
# コメント(#から開始)には, 駅共有や夜間通過などの情報があれば<～>で囲い記述し,(順不同)
# 最後に全駅との距離を nnn blocks の形式で記述する。
# このフォーマットに適合しない追加情報を記述したい場合は, 2回以上インデントとともに
# 新しい行に記述する。
# 例:
#          "HHH": (-285, 59, 346, "役場前"), # <駅共有/相互直通: "HBHHH"> <夜間通過> 123 blocks
#          # MMHHHへ分岐可
#
# ・駅共有/相互直通が複数駅ある場合の記述法:
#      <駅共有/相互直通: "HBHHH", "HCHHH", "HDHHH">

station_locations = {
    # harutrak A (2015/09/04現在)
    "HA": {
        "HHH": (-285, 59, 346, "役場前"), # <駅共有/相互直通: "HBHHH">
        "NMU": (-370, 70, 115, "中村"),  # 287 blocks
        "MCT": (-370, 70, -45, "メガネケエスタワー前(南)"),  # 162 blocks
        "MCW": (-398, 69, -58, "メガネケエスタワー前(西)"),  # 36 blocks
        "KIS": (-531, 69, -58, "北砂漠"),  # 131 blocks
        "NUM": (-711, 69, -58, "中海町"),  # 180 blocks
        "EEE": (-804, 67, -31, "エターナルフォースブリザード城前"),  # 117 blocks
        # 片側乗入: HGYOZ 192 blocks
    },
    # harutrak B (2015/09/07現在)
    "HB": {
        "HHH": (-285, 59, 346, "役場前"), # <駅共有/相互直通: "HAHHH">
        "SIB": (-329, 69, 508, "新橋"),  # 195 blocks
        "JIR": (-329, 69, 714, "辞林"),  # 206 blocks
        "NEM": (-395, 69, 739, "練馬"),  # 91 blocks
        "YYY": (-613, 69, 739, "雪見町"),  # 219 blocks
        "ZZZ": (-622, 69, 1081, "<仮駅1>"),  # 347 blocks
        "ZZZ": (-622, 69, 1454, "<仮駅2>"),  # 374 blocks
        "ZZZ": (-622, 69, 1613, "<仮駅3>"),  # 159 blocks
    },
    # harutrak C (2015/09/07現在)
    "HC": {
        # 駅共有/片側乗入(逆側ポイント分岐): MMNNO(MCT方面)
        "NNO": (-268, 70, 84, "中野"),
        # MMHHHへ分岐可
        # 路線共有: MMNNO-MMJJJ
        "JJJ": (-76, 72, 84, "城南"),  # 191 blocks
        "AAN": (-23, 57, 101, "空港北"),  # 64 blocks
        "JOT": (196, 77, 98, "城東"),  # 220 blocks
        "TOJ": (206, 69, -18, "藤冶湖"),  # 123 blocks
        "TSI": (206, 69, -142, "津入口"),  # 125 blocks
        "TTT": (201, 69, -364, "津港"),  # <駅共有/相互直通: "HDTTT"> 226 blocks
    },
    # harutrak D (2015/09/13現在)
    "HD": {
        # 特殊乗入: MCT
        "MCT": (-354, 72, -58, "メガネケエスタワー前(南)"),
        "MCW": (-370, 69, -56, "メガネケエスタワー前(西)"),
        "MCE": (-354, 72, -58, "メガネケエスタワー前(東)"),
        # MCT->MCE: 28 blocks, MCW->MCE:44 blocks
        "MEH": (-280, 69, -174, "明北"),  # 185 blocks
        "YAA": (-268, 69, -364, "宿木"),  # 206 blocks
        "YTH": (-21, 69, -364, "宿津平原"),  # 245 blocks
        "TTT": (202, 69, -363, "津港"),  # <駅共有/相互直通: "HCTTT"> 225 blocks
    },
    # harutrak E (2015/09/13現在)
    "HE": {
        # 駅共有/片側乗入(逆側ポイント分岐): HDYAA(YT方面)
        "YAA": (-266, 69, -364, "宿木"),
        "YAB": (-280, 73, -473, "北宿木"),  # 125 blocks
        "GEJ": (-280, 73, -708, "善通寺"),  # 236 blocks
        "FUT": (-280, 73, -1012, "古谷"),  # 303 blocks
        "KAD": (-280, 73, -1537, "楓"),  # 527 blocks
        "OMR": (-280, 73, -1885, "大室"),  # 346 blocks
    },
    # harutrak F (2015/09/16現在)
    "HF": {
        # 駅共有/片側乗入(逆側ポイント分岐): HBJIR(SB方面)
        "JIR": (-329, 69, 714, "辞林"),
        "JIC": (-184, 71, 734, "中辞林"),  # 160 blocks
        "NIT": (44, 71, 655, "新津"),  # 306 blocks
        "CCC": (353, 65, 655, "長府"),  # 307 blocks
        "TSB": (552, 67, 655, "筑波"),  # 201 blocks
        "TSU": (764, 67, 655, "土浦"),  # 212 blocks
        "SHZ": (866, 67, 743, "下北沢"),  # 190 blocks
        "SHE": (1025, 67, 807, "東北沢"),  # 219 blocks
        "SSS": (1043, 57, 914, "下関"),  # 129 blocks
    },
    # harutrak G (2015/09/13現在)
    "HG": {
        # 駅共有/片側乗入(逆側ポイント分岐): HEGEJ(FT方面)
        "GEJ": (-279, 73, -708, "善通寺"),
        "GES": (-275, 73, -542, "南善通寺"),  # 168 blocks
        "YAB": (-299, 67, -467, "北宿木"),  # 98 blocks
        "YAC": (-450, 67, -467, "旧宿木"),  # <夜間通過> 151 blocks
        "YAD": (-616, 67, -467, "西宿木"),  # 165 blocks
        "KAM": (-808, 67, -372, "春日野道"),  # <夜間通過> 284 blocks
        "EEE": (-809, 67, -31, "エターナルフォースブリザード城前"),  # 341 blocks
        "YOZ": (-950, 67, 18, "夜築町"),  # 190 blocks
        "KUY": (-1408, 70, 18, "久野山"),  # 459 blocks
        "ZZZ": (-1703, 73, 4, "<仮駅>"),  # 300 blocks
    },
    # harutrak H (2015/09/06現在)
    "HH": {
        # 駅共有/片側乗入(逆側ポイント分岐): HAKAD(FT方面)
        "KAD": (-279, 73, -1537, "楓"),
        "AOH": (268, 73, -1559, "青木ヶ原"),  # <夜間通過> 565 blocks
        "SKV": (574, 73, -1536, "鮭の子村"),  # 327 blocks
        # 鮭の子村 - いくら港間はパワードレールに電源が入っていない
        "IKP": (574, 73, -1278, "いくら港"),  # 258 blocks
    },
    # harutrak I (2015/09/07現在)
    "HI": {
        # 駅共有/片側乗入(逆側ポイント分岐): HCTSI(TT方面)
        "TSI": (206, 69, -142, "津入口"),
        "OIW": (842, 69, -133, "追分"), # 645 blocks
        "KAN": (1125, 69, 97, "北香住"),  # 509 blocks
    },
    # harutrak J (2015/09/06現在)
    "HJ": {
        "OIW": (842, 69, -140, "追分"),
        "OTP": (818, 69, -268, "大津港"),  # 153 blocks
    },
    # harutrak 空港連絡線 (2015/09/07現在)
    "HZ": {
        # 片側乗入: HCAAN(JOT方面)
        "AAN": (-23, 57, 101, "空港北"),
        "AAA": (9, 63, 280, "はる空港"),  # 233 blocks
    },
    # はるレール 南北快速線 (2015/09/06現在)
    "RN": {
        "GEJ": (-269, 54, -708, "善通寺"),
        "KIM": (-411, 50, -141, "北森"),  # 743 blocks
        "HHH": (-278, 59, 346, "役場前"),  # <駅共有/相互直通: "XXHHH"> 609 blocks
    },
    # はるレール 城南線 (2015/09/07現在)
    "RJ": {
        "EEE": (-825, 57, -83, "EFB城"),
        "NTS": (-417, 41, 97, "中津"),  # 577 blocks
        "NNO": (-281, 46, 93, "中野"),  # 136 blocks
        # 旧地下鉄中野NNCからNNOに統合
        "JJJ": (-85, 48, 89, "城南"),  # 196 blocks
        "KEE": (-142, 44, 224, "刑務所東"),  # 178 blocks
        "HHH": (-264, 59, 346, "役場前"),  # <駅共有/相互直通: "RTHHH"> 303 blocks
    },
    # はるレール 新津線 (2015/09/07現在)
    "RT": {
        "HHH": (-264, 59, 346, "役場前"), # <駅共有/相互直通: "RJHHH">
        "GOJ": (-266, 48, 426, "五条"),  # 80 blocks
        "MIN": (-174, 48, 458, "北三原"),  # 122 blocks
        "KOZ": (-52, 51, 484, "古津賀"),  # 139 blocks
        "NIT": (39, 63, 647, "新津"),  # 226 blocks
        "CCC": (333, 61, 688, "長府"),  # 324 blocks
        "TSH": (448, 74, 669, "筑波高原"),  # 128 blocks
        "TSB": (552, 68, 622, "新線筑波"),  # 157 blocks
        # 片側乗入: TRSAT 91 blocks
    },
    # はるレール 城津線(西城線) (2015/09/07現在)
    "RS": {
        "EEE": (-825, 64, -70, "EFB城"), # <駅共有/相互直通: "ENEEE">
        "SAB": (-626, 65, 227, "西原"),  # 502 blocks
        "HHH": (-286, 43, 337, "役場前"),  # 522 blocks
        "GOJ": (-286, 44, 443, "五条"), # 108 blocks
        "MIH": (-179, 52, 540, "三原"), # 191 blocks
        # 三原以南未着工
        # "NIT": (0, 0, 0, "新津"),
        # "CCC": (0, 0, 0, "長府"),
    },
    # はる急行鉄道 月沢本線 (2015/09/13現在)
    "XT": {
        # "SAK": (0, 0, 0, "佐倉"), # <片側乗入: EHSAK, NAG方面>
        # "YAA": (0, 0, 0, "宿木"),
        # "MEH": (0, 0, 0, "明北"),
        # "MCT": (0, 0, 0, "MCT前"),
        # 中村本町以北未成
        "NMU": (-357, 64, 153, "中村本町"), # <駅共有/相互直通: "XCNMU">
        "ICJ": (-496, 76, 184, "一条"),  # 192 blocks
        "SAB": (-622, 75, 230, "西原"),  # 169 blocks
        "TYS": (-562, 72, 416, "月屋根沢"),  # 234 blocks
        "SNM": (-564, 72, 580, "スノーマン前"),  # 165 blocks
        "IBY": (-564, 72, 702, "伊吹山"),  # 123 blocks
        "YYY": (-599, 73, 747, "雪見町"),  # 78 blocks
        # 上下線とも, 雪見温泉駅前後を乗り通すことは出来ず, 一度乗り換える必要あり
        "YUO": (-850, 71, 715, "雪見温泉"),  # 296 blocks
        "KAI": (-1013, 77, 747, "上砂"),  # 205 blocks
        "AOM": (-1152, 72, 747, "青宮"),  # 144 blocks
        "TEK": (-1290, 77, 747, "天竜峡"),  # 134 blocks
        "NAF": (-1308, 67, 815, "南海埠頭"),  # 77 blocks
    },
    # はる急行鉄道 月沢急行線 (2015/09/06現在)
    "XX": {
        "HHH": (-278, 59, 346, "役場前"), # <駅共有/相互直通: "RNHHH">
        "TYS": (-563, 72, 417, "月屋根沢"),  # 356 blocks
        # 駅共有/逆側ポイント分岐?: TRYYY
        "YYY": (-594, 69, 747, "雪見町"),  # 354 blocks
        "KAI": (-1015, 77, 747, "上砂"),  # 420 blocks
        "NAF": (-1308, 67, 814, "南海埠頭"),  # 354 blocks
    },
    # はる急行鉄道 南海急行線 (2015/09/13現在)
    "XN": {
        "EEE": (0, 0, 0, "EFB城"), # <駅共有 XHEEE/XEEEE (双方ポイント分岐)>
        "YOZ": (-941, 58, 7, "夜築町"),  # * blocks <駅共有/ポイント分岐: XSYOZ>
        "KAI": (-998, 70, 747, "上砂"),  # 748 blocks
        "TOT": (-1220, 68, 1115, "鳥取"),  # 435 blocks
        "CTS": (-1648, 680, 1446, "千歳"),  # 447 blocks
        "SAN": (-1669, 64, 1980, "作並"),  # 536 blocks
    },
    # はる急行鉄道 北越線
    "XH": {
        "WKN": (-1798, 65, -657, "稚内"),
        "HGZ": (-1745, 64, -498, "星川銀座"),  # 197 blocks
        "KIH": (-1475, 72, -346, "北見平原"),  # 419 blocks
        "YUB": (-963, 65, -346, "結上橋"),  # 513 blocks
        "EEE": (0, 0, 0, "EFB城"), # <駅共有 XNEEE/XHEEE>
        # XHEEE では ポイント切替で XNYOZ, XEGEJ 方面乗入可能
        "NUM": (0, 0, 0, "中海町"), # * blocks
        "YUH": (0, 0, 0, "由利本荘"), # * blocks
        "HGW": (0, 0, 0, "雛川"), # *
        "YAC": (0, 0, 0, "旧宿木"), # *
        "KIY": (0, 0, 0, "霧弥湖町"), # * blocks
        "GEJ": (0, 0, 0, "善通寺"), # * blocks
        # 以下工事中
        # "NAG": (0, 0, 0, "永江池"), # * blocks
        # "SAK": (0, 0, 0, "佐倉"), # * blocks
        # "YTH": (0, 0, 0, "宿津平原"), # * blocks
        # "TTT": (0, 0, 0, "津港"), # * blocks
        # "YON": (0, 0, 0, "夜ノ森"), # * blocks
        # "HAO": (0, 0, 0, "浜大津"), # * blocks
        # "OTP": (0, 0, 0, "大津港"), # * blocks
    }
    # はる急行鉄道 北越線(城西短絡線)
    "XJ": {
        "YUB": (-963, 65, -346, "結上橋"),  # <駅共有/ポイント分岐予定 XHYUB>
        "YOZ": (-941, 58, 7, "夜築町"),  # <駅共有/ポイント分岐 XNYOZ/XSYOZ>
    }
    # はる急行鉄道 北越急行線
    "XE": {
        "EEE": (0, 0, 0, "EFB城"), # <駅共有 XNEEE/ポイント切替 XHEEE>
        "GEJ": (0, 0, 0, "善通寺"), # * blocks
        "TTT": (0, 0, 0, "津港"), # * blocks
        "OTP": (0, 0, 0, "大津港"), # * blocks
    }
    # はる急行鉄道 参宮線 (2015/09/07現在)
    "XS": {
        "YOZ": (-941, 58, 7, "夜築町"),  # <駅共有 XNYOZ>
        "HIZ": (-835, 64, 190, "雲雀坂"),  # 279 blocks
        "SAB": (-630, 75, 230, "西原"),  # 275 blocks
        "KOT": (-519, 76, 249, "こむぎこタワー"),  # 132 blocks
        "TYS": (-554, 72, 416, "月屋根沢"), # 206 blocks
        "TSS": (-520, 79, 477, "月山神社"),  # 92 blocks
        "SIB": (-323, 64, 499, "新橋"),  # 240 blocks
    },
    # はる急行鉄道 中部丘陵線 (2015/09/07現在)
    "XC": {
        "NMU": (-357, 64, 153, "中村本町"), # <駅共有/相互直通: "XTNMU">
        "MCT": (-359, 66, -39, "メガネケエスタワー"),  # 193 blocks
        "MOY": (-234, 65, -74, "守山"),  # 153 blocks
        "JOH": (-79, 67, -74, "城北"),  # 155 blocks
        "TSI": (198, 64, -151, "津入口"),  # 347 blocks
    },
    # はる高速旅客鉄道 中央新幹線 (2015/09/05現在)
    "SC": {
        "WKN": (-1797, 65, -657, "稚内"),
        "EEE": (-838, 69, -54, "EFB城"),  # 993 blocks
        "HHH": (-287, 54, 377, "新役場"),  # 668 blocks
        "AAA": (45, 54, 275, "はる空港"),  # 332 blocks
        "CCN": (319, 64, 566, "新長府"),  # 335 blocks
        "SSS": (1026, 65, 901, "下関"),  # 713 blocks
        "NGO": (1678, 76, 1443, "名古屋"),  # 680 blocks
    },
    # はる高速旅客鉄道 南北新幹線 (2015/09/07現在)
    "SN": {
        "TTT": (158, 71, -346, "津港"),
        "JJJ": (-67, 52, 77, "城南"),  # 435 blocks
        "HHH": (-271, 39, 387, "新役場"),  # 310 blocks
        "YYY": (-602, 60, 755, "雪見町"),  # 387 blocks
    },
    # ムメイ高速鉄道 ムメイ高速鉄道本線 (2015/09/13現在)
    "MM": {
        # 特殊乗入: MCT
        "MCE": (-355, 72, -59, "メガネケエスタワー前(東)"),
        "NNO": (-267, 70, 84, "中野"),  # 229 blocks
        # 路線共有: HCNNO - HCJJJ
        # 駅共有/片側乗入(逆側ポイント分岐): HCJJJ(NNO方面)
        "JJJ": (-76, 72, 84, "城南"),
        "HHH": (-259, 67, 293, "役場前(東梅田)"),
        # NNO->HHH: 224, JJJ->HHH: 380
        "SHK": (-165, 67, 312, "湘南海岸"),  # 105 blocks
        "AAA": (38, 68, 312, "はる空港"),  # 204 blocks
        "TYF": (361, 68, 312, "調布"),  # 323 blocks
        "KAS": (1203, 68, 312, "香住"),  # 841 blocks
    },
    # ムメイ高速鉄道 香住ライトレール線 (2015/09/05現在)
    "MK": {
        "KAS": (1187, 65, 312, "香住"),
        # 中間にある2駅は無視
        "KAN": (1127, 64, 124, "北香住"),  # 245 blocks
    },
    # はる近郊鉄道 内環線 (2015/08/31現在)
    "KI": {
        "JIR": (-329, 74, 720, "辞林"),  # 230 blocks
        "SAO": (-429, 53, 564, "ささみ温泉"),  # 238 blocks
        "TSS": (-492, 76, 487, "月山神社"),  # 102 blocks
        "KOT": (-503, 76, 249, "こむぎこタワー"),  # 246 blocks
        "TAI": (-433, 69, 199, "絶海池"),  # 84 blocks
        "NTS": (-427, 38, 84, "中津"),  # 119 blocks
        "NMU": (-380, 55, 96, "中村"),  # 47 blocks
        "NNO": (-274, 55, 111, "中野"),  # 106 blocks
        "KEE": (-163, 66, 223, "刑務所東"),  # 206 blocks
        "SHK": (-173, 72, 308, "湘南海岸"),  # 87 blocks
        "SHJ": (-177, 53, 403, "しきみ城"),  # 96 blocks
        "MIN": (-177, 53, 449, "北三原"),  # 46 blocks
        "MIH": (-185, 52, 540, "三原"),  # 92 blocks
    },
    # はる近郊鉄道 空港線 (2015/08/31現在)
    "KA": {
        # 駅共有/片側乗入(逆側ポイント分岐): NIKEE(SG方面)
        "KEE": (-162, 66, 222, "刑務所東"),
        "JJJ": (-93, 63, 94, "城南"),  # 194 blocks
        "AAN": (-35, 49, 93, "空港北"),  # 74 blocks
    },
    # こむぎ娘レールウェイ 千歳線 (2015/09/01現在)
    "FC": {
        "YYY": (-602, 82, 757, "雪見町"),
        "TAS": (-726, 91, 860, "高瀬"),  # 219 blocks
        "DAS": (-1188, 76, 855, "大山"),  # 462 blocks
        "TOT": (-1233, 72, 1121, "鳥取"),  # 318 blocks
        "HIO": (-1442, 98, 1204, "光が丘"),  # <夜間通過> 288 blocks
        "CTS": (-1664, 74, 1430, "千歳"),  # 448 blocks
        "CTM": (-1663, 67, 1596, "南千歳"),  # <夜間通過> 166 blocks
        "SAN": (-1636, 82, 2012, "作並"),  # 516 blocks
    },
    # こむぎ娘レールウェイ 海岸線 (2015/09/07現在)
    "FK": {
        # 駅共有/逆側片側乗り入れ: KKCTS -> KCHIO ( 449 blocks)
        "CTS": (-1664, 74, 1430, "千歳"),
        "CTK": (-1830, 78, 1446, "千歳海岸"),  # 177 blocks
    },
    # こむぎ娘レールウェイ 作長線 (2015/09/01現在)
    "FS": {
        "SAN": (-1644, 74, 2006, "作並"),
        "SOG": (-1086, 80, 2000, "蘇我"),  # 562 blocks
        "FUK": (-633, 64, 1920, "船越"),  # 615 blocks
        "OTK": (243, 89, 1691, "大月"),  # 1166 blocks
        "MIS": (251, 73, 1177, "水無瀬"),  # 522 blocks
        "ODW": (349, 76, 901, "小田原"),  # 372 blocks
        "CCC": (333, 61, 682, "長府"),  # 261 blocks
    },
    # こむぎ娘レールウェイ 東海線 (2015/09/07現在)
    "FT": {
        "OTK": (246, 95, 1678, "大月"),
        "KUM": (949, 70, 1476, "国見"),  # 932 blocks
        "SSS": (1085, 50, 930, "下関"),  # 757 blocks
        "KAS": (1180, 51, 371, "香住"),  # 753 blocks
    },
    # こむぎ娘レールウェイ 東西線 (2015/09/07現在)
    "FO": {
        "NNO": (-269, 71, 103, "中野"),
        "KOT": (-514, 83, 266, "こむぎこタワー"),  # 447 blocks
        "NIZ": (-800, 66, 388, "西塚"),  # 405 blocks
        "AOM": (-1176, 67, 756, "青宮"),  # 739 blocks
        "DAS": (-1188, 76, 852, "大山"),  # 106 blocks
    },
    # 東部環状鉄道 東部環状線 (2015/08/31現在)
    "LT": {
        "HHH": (-270, 59, 346, "役場前"),  # 105 blocks (from LTGOJ)
        "TAI": (-420, 34, 84, "絶海池"),  # 280 blocks
        "NTS": (-418, 34, 78, "中津"),  # 113 blocks
        "KIM": (-419, 50, -141, "北森"),  # 220 blocks
        "YAA": (-267, 69, -358, "宿木"),  # 364 blocks
        "TTT": (216, 69, -329, "津港"),  # 522 blocks
        "JOT": (212, 70, 88, "城東"),  # 418 blocks
        "TYF": (348, 73, 307, "調布"),  # 349 blocks
        "CCN": (370, 56, 592, "環鉄新長府"),  # 298 blocks
        "CCC": (332, 61, 670, "長府"),  # 114 blocks
        "NIT": (33, 69, 666, "新津"),  # 298 blocks
        "KYS": (25, 79, 848, "京ヶ瀬"),  # 188 blocks
        "SUB": (-83, 76, 878, "水原"),  # 141 blocks
        "MOS": (-190, 68, 841, "森下"),  # 144 blocks
        "JIC": (-190, 66, 745, "中辞林"),  # 96 blocks
        "MIH": (-190, 52, 540, "三原"),  # 206 blocks
        "SIB": (-287, 46, 515, "新橋"),  # 120 blocks
        "GOJ": (-285, 44, 443, "五条"),  # 72 blocks
    },
    # 筑波臨海高速鉄道 つくば線 (2015/09/05現在)
    "TT": {
        "CCC": (332, 61, 666, "長府"),
        "CCN": (362, 64, 575, "新長府"),  # 123 blocks
        "SHT": (434, 66, 566, "新都心"),  # 79 blocks
        "TSD": (520, 68, 566, "筑波大学"),  # 86 blocks
        "TSB": (571, 68, 628, "筑波"),  # 93 blocks
        "SAT": (652, 64, 628, "桜土浦"),  # 82 blocks
        "TSU": (751, 64, 626, "土浦"),  # 99 blocks
        # 駅共有?: TRTSU, TSTSU //FIX ME(土浦駅のポイント,駅共有,乗り入れの表記がわからないため)
    },
    # 筑波臨海高速鉄道 りんかい線 (2015/09/07現在)
    "TR": {
        # 駅共有,逆側ポイント分岐?: XXYYY
        "YYY": (-594, 69, 747, "雪見町"),
        "JIR": (-334, 69, 746, "辞林"),  # 267 blocks
        "CCN": (362, 68, 586, "新長府"),  # 686 blocks
        "TSB": (556, 64, 628, "筑波"),  # 195 blocks
        "TSU": (751, 64, 626, "土浦"),  # 197 blocks
        # 駅共有?: TTTSU, TSTSU //FIX ME
        "OAR": (764, 67, 448, "大洗"),  # 182 blocks
        "HAS": (764, 64, 311, "浜坂"),  # 138 blocks
        "KAS": (1176, 64, 291, "香住"),  # 421 blocks
    },
    # 筑波臨海高速鉄道 下関線 (2015/09/02現在)
    "TS": {
        # 直通
        "TSU": (751, 64, 626, "土浦"),
        # 駅共有?: TTTSU, TRTSU //FIX ME
        "SHZ": (911, 67, 754, "下北沢"),  # 281 blocks
        "SIM": (911, 68, 863, "東雲"),  # 107 blocks
        "SSS": (1039, 63, 916, "下関"),  # 163 blocks
    },
    # 竜ヶ崎臨海鉄道 竜ヶ崎線 (2015/09/07現在)
    "GR": {
        "TSB": (535, 64, 636, "筑波"),
        "RYS": (528, 66, 895, "竜ヶ崎"),  # 260 blocks
        "KOS": (619, 66, 984, "神津島"),  # 177 blocks
        "SSS": (1044, 63, 918, "下関"),  # 506 blocks
    },
    # ささみ鉄道 ちくわエクスプレス線 (2015/09/01現在)
    "CC": {
        "HHH": (-261, 59, 344, "役場前"),
        "DAM": (-323, 89, 400, "大明神前"),  # 188 blocks
        "SAO": (-424, 82, 561, "ささみ温泉"),  # 218 blocks
        "NEM": (-410, 74, 727, "練馬"),  # 173 blocks
        "YYY": (-603, 82, 757, "雪見町"),  # 202 blocks
    },
    # 比那名居電鉄 釧結線 (2015/08/31現在)
    "WS": {
        # 役場方面ではLTKIMのホームへ乗り入れ
        "KIM": (-429, 50, -137, "北森"),
        "YAE": (-377, 71, -311, "元宿木"), # 222 blocks
        "TKN": (-397, 58, -350, "筍"), # 61 blocks
        "HGW": (-534, 66, -319, "雛川"), # 162 blocks
        "KAM": (-818, 63, -330, "春日野道"), # 293 blocks
        "YUB": (-962, 65, -340, "結上橋"), # 153 blocks
        "VTX": (-1069, 64, -629, "暴龍天山"), #393 blocks
        # VTXは地上出口なし
        "KUS": (-964, 67, -862, "釧路"), # 335 blocks
    },
    # 比那名居電鉄 百合線 (2015/08/31現在)
    "WY": {
        "KUS": (-949, 51, -874, "釧路"),
        "KRM": (-801, 71, -875, "桐間"), # 148 blocks
        "TTM": (-581, 72, -876, "戸津美"), # 220 blocks
        "UJM": (-345, 74, -874, "宇治松"), # 236 blocks
        "KFH": (-243, 92, -874, "香風ヶ丘"), # 102 blocks
        "TDB": (9, 63, -868, "天々座湾"), # 256 blocks
        "HTO": (101, 64, -839, "保登"), # 120 blocks
    },
    # 比那名居電鉄 保宿線 (2015/08/31現在)
    "WH": {
        "HTO": (109, 64, -841, "保登"),
        "NAG": (-155, 64, -644, "永江池"), # 460 blocks
        "GEJ": (-277, 67, -699, "善通寺"), # 186 blocks
        "GES": (-279, 66, -547, "南善通寺"), # 154 blocks
        "YAA": (-287, 68, -372, "宿木"), # 194 blocks
        "TKN": (-384, 70, -370, "筍"), # 97 blocks
    },
    # 比那名居電鉄 南海佐倉線 (2015/10/18現在)
    "WW": {
        "HGW": (-543, 62, -325, "雛川"),
        "YRH": (-533, 63, -155, "由利本荘"), # 183 blocks
        "ICJ": (-483, 80, 182, "一条") # 387 blocks
        "TSS": (-502, 82, 475, "月山神社") # 318 blocks
        # 工事中
    },
    # はる航空 はる空港-津ヘリポート線 (2015/09/06現在)
    "AT": {
        "AAA": (34, 64, 272, "はる空港"),
        "TTT": (186, 64, -387, "津ヘリポート") # 1 blocks
    },
    # はる航空 はる空港-しきみ島線 (2015/09/06現在)
    "AS": {
        "AAA": (38, 64, 272, "はる空港"),
        "SHI": (724, 65, -837, "しきみ島空港"), # 1 blocks
    },
    # はる航空 はる空港-大室線 (2015/09/06現在)
    "AO": {
        "AAA": (30, 64, 272, "はる空港"),
        "OMR": (-206, 64, -1926, "大室飛行場"), # 1 blocks
    },
    # 船便 ship#1 - ship#3線 (2015/09/06現在)
    "B1": {
        "SH1": (225, 61, -378, "ship#1"),
        "SH3": (737, 61, -757, "ship#3"), # 1 blocks
    },
    # 船便 大津港 - ship3#2線 (2015/09/06現在)
    "B2": {
        "OTP": (833, 64, -287, "大津港"),
        "SH3": (740, 61, -756, "ship3 #2"), # 1 blocks
    },
    # 船便 いくら港 - ship3#3線 (2015/09/06現在)
    "B3": {
        "IKP": (599, 63, -1235, "いくら港"),
        "SH3": (741, 61, -756, "ship3 #3"), # 1 blocks
    },
    # hu2r railway Capital Line (2015/09/07現在)
    "ZC": {
        "FUO": (-196, 72, 342, "藤が丘"),
        "SHJ": (-178, 53, 403, "しきみ城"),  # 75 blocks
        "MIH": (-180, 57, 540, "三原"),  # 137 blocks
    },
    # SRH 外環線 (2015/09/05現在)
    "ZG": {
        "TSB": (555, 60, 645, "筑波"),
        "NIS": (634, 53, 346, "西砂丘村"),  # 303 blocks
        "OTP": (819, 73, -139, "追分"), # 492 blocks
    },
    # かき地下鉄 姫子線 (2015/09/13現在)
    "ZH": {
        # 駅共有/片側乗入(逆側ポイント分岐): HDYTH(YAA方面)
        "YTH": (-21, 69, -364, "宿津平原"),
        "HII": (-8, 20, -632, "遺跡"),  # 275 blocks
        "HIC": (-8, 20, -937, "姫子市"),  # 307 blocks
    },
    # 遺跡線 (2015/08/31現在)
    "ZI": {
        "HHH": (-334, 67, 341, "旧役場前"),
        "TSI": (-521, 20, 422, "月山神社地下遺跡"), # 265 blocks
    },
    # キルミー鉄道 ゆっくりライン (2015/08/31現在)
    "ZK": {
        "HHH": (-289, 35, 337, "役場前"),
        "YUH": (-290, 8, 300, "ゆっくりハウス"),  # 98 blocks
        "HAI": (-221, 9, 300, "はるアイコン"),  # 69 blocks
        "REH": (-142, 8, 291, "れいかハウス"),  # 82 blocks
        #ZKREHには出口はあるが地上には出られない
        "YUK": (-82, 10, 291, "ゆっくりライン貨物ターミナル"),  # 61 blocks
        #ZKYUKには出口なし
    },
    # 鮭の子村交通局 寿司線 (2015/09/06現在)
    "ZS": {
        # 現在建設中
        "SKV": (568, 50, -1503, "鮭の子村"),
        "SHI": (755, 65, -869, "しきみ島"),  # 816 blocks
    },
    # はる地下鉄 調布市地下鉄線 (2015/09/07現在)
    "ZT": {
        "TYF": (407, 49, 336, "調布"),
        "TYE": (528, 49, 336, "東調布"),  # 122 blocks
        "NIS": (614, 49, 336, "西砂丘村"),  # 86 blocks
        "HAS": (776, 49, 321, "浜坂"),  # 169 blocks
    },
    # その他(なし)
    "ZZ": {}
}
